zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_fmc.h
  uint32_t DataAddressMux;               /*!< Specifies whether the address and data values are
                                          multiplexed on the data bus or not.
                                          This parameter can be a value of @ref FMC_Data_Address_Bus_Multiplexing    */

  uint32_t MemoryType;                   /*!< Specifies the type of external memory attached to
                                          the corresponding memory device.
                                          This parameter can be a value of @ref FMC_Memory_Type                      */

  uint32_t MemoryDataWidth;              /*!< Specifies the external memory device width.
                                          This parameter can be a value of @ref FMC_NORSRAM_Data_Width               */

  uint32_t BurstAccessMode;              /*!< Enables or disables the burst access mode for Flash memory,
                                          valid only with synchronous burst Flash memories.
                                          This parameter can be a value of @ref FMC_Burst_Access_Mode                */

  uint32_t WaitSignalPolarity;           /*!< Specifies the wait signal polarity, valid only when accessing
                                          the Flash memory in burst mode.
                                          This parameter can be a value of @ref FMC_Wait_Signal_Polarity             */

  uint32_t WaitSignalActive;             /*!< Specifies if the wait signal is asserted by the memory one
                                          clock cycle before the wait state or during the wait state,
                                          valid only when accessing memories in burst mode.
                                          This parameter can be a value of @ref FMC_Wait_Timing                      */

  uint32_t WriteOperation;               /*!< Enables or disables the write operation in the selected device by the FMC.
                                          This parameter can be a value of @ref FMC_Write_Operation                  */

  uint32_t WaitSignal;                   /*!< Enables or disables the wait state insertion via wait
                                          signal, valid for Flash memory access in burst mode.
                                          This parameter can be a value of @ref FMC_Wait_Signal                      */

  uint32_t ExtendedMode;                 /*!< Enables or disables the extended mode.
                                          This parameter can be a value of @ref FMC_Extended_Mode                    */

  uint32_t AsynchronousWait;             /*!< Enables or disables wait signal during asynchronous transfers,
                                          valid only with asynchronous Flash memories.
                                          This parameter can be a value of @ref FMC_AsynchronousWait                 */

  uint32_t WriteBurst;                   /*!< Enables or disables the write burst operation.
                                          This parameter can be a value of @ref FMC_Write_Burst                      */

  uint32_t ContinuousClock;              /*!< Enables or disables the FMC clock output to external memory devices.
                                          This parameter is only enabled through the FMC_BCR1 register, and don't care
                                          through FMC_BCR2..4 registers.
                                          This parameter can be a value of @ref FMC_Continous_Clock                  */

  uint32_t PageSize;                     /*!< Specifies the memory page size.
                                          This parameter can be a value of @ref FMC_Page_Size                        */

  uint32_t NBLSetupTime;                 /*!< Specifies the NBL setup timing clock cycle number
                                          This parameter can be a value of @ref FMC_Byte_Lane                        */
} FMC_NORSRAM_InitTypeDef;

/**
  * @brief  FMC NORSRAM Timing parameters structure definition
  */
typedef struct
{
  uint32_t AddressSetupTime;             /*!< Defines the number of HCLK cycles to configure
                                          the duration of the address setup time.
                                          This parameter can be a value between Min_Data = 0 and Max_Data = 15.
                                          @note This parameter is not used with synchronous NOR Flash memories.      */

  uint32_t AddressHoldTime;              /*!< Defines the number of HCLK cycles to configure
                                          the duration of the address hold time.
                                          This parameter can be a value between Min_Data = 1 and Max_Data = 15.
                                          @note This parameter is not used with synchronous NOR Flash memories.      */

  uint32_t DataSetupTime;                /*!< Defines the number of HCLK cycles to configure
                                          the duration of the data setup time.
                                          This parameter can be a value between Min_Data = 1 and Max_Data = 255.
                                          @note This parameter is used for SRAMs, ROMs and asynchronous multiplexed
                                          NOR Flash memories.                                                        */

  uint32_t DataHoldTime;                 /*!< Defines the number of HCLK cycles to configure
                                          the duration of the data hold time.
                                          This parameter can be a value between Min_Data = 0 and Max_Data = 3.
                                          @note This parameter is used for used in asynchronous accesses.            */

  uint32_t BusTurnAroundDuration;        /*!< Defines the number of HCLK cycles to configure
                                          the duration of the bus turnaround.
                                          This parameter can be a value between Min_Data = 0 and Max_Data = 15.
                                          @note This parameter is only used for multiplexed NOR Flash memories.      */

  uint32_t CLKDivision;                  /*!< Defines the period of CLK clock output signal, expressed in number of
                                          HCLK cycles. This parameter can be a value between Min_Data = 2 and
                                          Max_Data = 16.
                                          @note This parameter is not used for asynchronous NOR Flash, SRAM or ROM
                                          accesses.                                                                  */

